# ExternallyTaggedNonBReps Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternallyTaggedNonBReps Constructor
ExternallyTaggedNonBReps Class See Also
---
Make a new empty collection of ExternallyTaggedNonBRep instances.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public ExternallyTaggedNonBReps()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExternallyTaggedNonBReps()
```

# See Also
ExternallyTaggedNonBReps Class
Autodesk.Revit.DB Namespace